#!/usr/bin/python
# -*- coding:utf-8 -*-

from com.obs.models.base_model import BaseModel, BASESTRING

#===============================================================================
# S3中的存储空间，模拟存储空间的逻辑结构
#===============================================================================
class Bucket(BaseModel):
    
    #===========================================================================
    # 初始化
    # @name        存储空间名
    # @create_date 存储空间的创建日期
    #===========================================================================
    allowedAttr = {'name': BASESTRING, 'create_date': BASESTRING}

