#!/usr/bin/python
# -*- coding:utf-8 -*-

from com.obs.models.base_model import BaseModel,BASESTRING

#===============================================================================
# 前缀（prefix）与分隔符（delimiter）第一次出现之间的字符串将保存到CommonPrefix列表中
#===============================================================================
class CommonPrefix(BaseModel):
    
    #===========================================================================
    # 初始化
    # @prefix 生成前缀
    #===========================================================================
    allowedAttr = {'prefix': BASESTRING}







